/*
 ************************************************************************************************
 *
 *  OSA cooperative RTOS for microcontrollers PIC, AVR and STM8
 *
 *  OSA is distributed under BSD license (see license.txt)
 *
 *  URL:            http://wiki.pic24.ru/doku.php/en/osa/ref/intro
 *
 *----------------------------------------------------------------------------------------------
 *
 *  File:           osa.h
 *
 *  Compilers:      HT-PICC STD
 *                  HT-PICC PRO
 *                  HT-PICC18 STD
 *                  Mplab C18
 *                  Mplab C30
 *                  MikroC PRO
 *                  CCS
 *                  WinAVR
 *                  IAR
 *                  Cosmic
 *                  Raisonance
 *
 *  Programmer:     Timofeev Victor
 *                  osa@pic24.ru, testerplus@mail.ru
 *
 *  Description:    This file contains all prototypes of functions and variables,
 *                  data types definitions, system constants.
 *                  This file must be included in all modules that use OSA services.
 *
 *  History:        10.00.2010 -    Removed all modification marks
 *  History:        10.07.2010 -    Added ports for STM8: IAR and Raisonance
 * 
 *                  25.10.2010  -   Bug fixed: OS_Qtimer_Break did not deleted timer from the list
 *                              -   Bug fixed: interrupt became disables after calling OS_Qtimer_Run for timer already

#error "OSA error #20: Bad TTIMER size (must be 1, 2 or 4)"
        /* See manual section "Appendix/Error codes" for more information*/
#endif









/*
 ************************************************************************************************
 *                                                                                              *
 *  S Y S T E M   D A T A   T Y P E S                                                           *
 *                                                                                              *
 ************************************************************************************************
 */

//******************************************************************************
//  Simple byte message
// (this type should be defined BEFORE including port\osa_xxx.h)
//******************************************************************************

#ifdef  OST_SMSG
#error "OSA error #14: Can't redefine name OST SMSG in 'OSAcfg.h'. Use OST_SMSG instead."
        /* See manual section "Appendix/Error codes" for more information*/
#endif


#if !defined(OS_SMSG_TYPE)
#define     OS_SMSG_TYPE    unsigned char
#endif

typedef OS_SMSG_TYPE    _OST_SMSG;      //  See port\pic16\osa_pic16_htpicc.h for example







/************************************************************************************************
 *                                                                                              *
 *     INCLUDE PROCESSOR SPECIFIC DEFINITIONS                                                   *
 *                                                                                              *
 ************************************************************************************************/

#include "port\osa_include.h"

#define OST_WORD        OST_UINT
#define _OST_INT_TYPE   OST_WORD        // Old types redefining (don't use it)
#define __osa_word      OST_WORD        // Old types redefining (don't use it)
#define __osa_uint8     OST_UINT8       // Old types redefining (don't use it)
#define __osa_uint16    OST_UINT16      // Old types redefining (don't use it)
#define __osa_uint32    OST_UINT32      // Old types redefining (don't use it)


typedef OS_SMSG_TYPE    OST_SMSG;



//******************************************************************************
//  Pointer to message
//******************************************************************************

#ifdef  OST_MSG
#error "OSA error #15: Can't redefine name OST MSG in 'OSAcfg.h'. Use OST_MSG instead."
        /* See manual section "Appendix/Error codes" for more information*/
#endif

#if !defined(OS_MSG_TYPE)
#define OS_MSG_TYPE     void *
#endif


typedef OS_MSG_TYPE     OST_MSG;



//******************************************************************************
//  Pointer to message descriptor
//******************************************************************************

typedef 
#ifndef __OSA_AVR_CODEVISION__
        volatile 
#endif
                    struct _OST_MSG_CB
{
    OST_UINT        status;     // State (=1 - busy / =0 - free)
    OST_MSG         msg;        // Pointer to message body

} OST_MSG_CB;





//******************************************************************************
//  Message's queues
//******************************************************************************

/*--- Queue's control block                         ---*/

typedef struct
{
    OST_UINT   cSize;      // Queue size
    OST_UINT   cFilled;    // Number of filled elements
    OST_UINT   cBegin;     // First element in buffer
                           // 
} OST_QUEUE_CONTROL;


/*--- Descriptor of queue of pointers to messages   ---*/

typedef struct
{
    OST_QUEUE_CONTROL Q;
    OST_MSG *pMsg;              // Pointer to queue buffer

} OST_QUEUE;


/*--- Descriptor of queue of simple messages        ---*/

typedef struct
{
    OST_QUEUE_CONTROL Q;
    OST_SMSG *pSMsg;            // Pointer to queue buffer

} OST_SQUEUE;



//******************************************************************************
//  Flags
//******************************************************************************

#define OST_FLAG    OST_UINT8
#define OST_FLAG8   OST_UINT8
#define OST_FLAG16  OST_UINT16
#define OST_FLAG32  OST_UINT32





//******************************************************************************
//  
//  System state flags
// 
//  (!!!Do not change positions of theese bits. For MCC30 bits
//  cIPL_Temp must occupy 5, 6 and 7 positions)
//******************************************************************************

typedef struct
{
    /*0*/   OST_UINT   bEventError        : 1; // Event error
    /*1*/   OST_UINT   bError             : 1; // Task create error
                                               // Stimer Create error
    /*2*/   OST_UINT   bInCriticalSection : 1; // One of task is in critical
                                               // section
    /*3*/   OST_UINT   bCheckingTasks     : 1; // OS_Sched:
                                               //   =1 - best task searching
                                               //   =0 - best task executed
    /*4*/   OST_UINT   bBestTaskFound     : 1; // OS_Sched: Best task found


    //------------------------------------------------------------------------------
    // Processor specified bits
    //------------------------------------------------------------------------------
            _OS_SYSTEM_FLAGS_PROC_SPEC()       // see definition in h-files for
                                               // each processor type in "port" folder

            #if OS_PRIORITY_LEVEL == OS_PRIORITY_EXTENDED
            OST_UINT   bEventOK           : 1; // Goes "1" when task was run after OS_Wait
                                               // See OS_Sched definition
                                               // 
                                               // Have #15 for PIC24 and dsPIC !!!!
                                               // 
            #endif


} OST_SYSTEM_FLAGS;




//******************************************************************************
//  
//  Task state flags
// 
//  !Do not change placement of theese bits
//******************************************************************************


#ifndef OSA_TASK_STATE_PROC_SPEC
#define OSA_TASK_STATE_PROC_SPEC()
#endif

typedef          struct
{
    /*0..2*/OST_UINT   cPriority   : 3;     // Task priority (0..7)
    /*3*/   OST_UINT   bReady      : 1;     // Ready to execute
    /*4*/   OST_UINT   bDelay      : 1;     // Timer active: OS_Delay (bCanContinue=0)
                                            // or event waiting with timeout (bCanContinue=1)

    /*5*/   OST_UINT   bCanContinue: 1;     // Can continue, while bDelay flag is set
    /*6*/   OST_UINT   bEnable     : 1;     // Descriptor is busy by task
    /*7*/   OST_UINT   bPaused     : 1;     // Task paused (it is still active, but can
                                            // became ready only from extenal task)

            OSA_TASK_STATE_PROC_SPEC()      // see definition in h-files for
                                            // each processor type in "port" folder

} OST_TASK_STATE;

//------------------------------------------------------------------------------

#define OS_TASK_PRIORITY_MASK       0x07
#define OS_TASK_READY_MASK          0x08
#define OS_TASK_DELAY_MASK          0x10
#define OS_TASK_CANCONTINUE_MASK    0x20
#define OS_TASK_ENABLE_MASK         0x40
#define OS_TASK_PAUSED_MASK         0x80

//------------------------------------------------------------------------------




//******************************************************************************
//  Task control block (descriptor)
//******************************************************************************

typedef struct
{
